{
  "basics": {
    "email": "kevark  @gmail.com",
    "name": "Kevin Park",
    "label": "Unemployed",
    "phone": "(909) 331-0613",
    "website": "http://kevinpark.io",
    "summary": "I enjoy solving problems, main reason why I ended up studying in Mathematics and Statistics.  Recently two my latest hobbies is learning more about deep learning and coding competiitions. Learning more about these two topics has given me exposure on how different algorithms and are used to create solutions. ",
    "location": {
      "address": "1143 S. Cliffpark Cir",
      "postalCode": "92805",
      "city": "Anaheim",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [{
      "network": "Medium",
      "username": "kevark",
      "url": "https://medium.com/@kevark"
    },
    {
      "network": "GitHub",
      "username": "kevark",
      "url": "https://github.com/kevark"
    },
    {
      "network": "LinkedIn",
      "username": "kevinpark87",
      "url": "https://www.linkedin.com/in/kevinpark87"
    }]
  },
  "projects": [
    {
      "School": "Oregon State University",
      "startDate": "2015-03-01",
      "summary": "The goal was to extract features (metrics) from images of the different species of plankton. These features were used to classify the different species of plankton. The data for this project was provided  from an open competition (National Data Science Bowl) on Kaggle.",
      "highlights": [
        "Using a mixture of edge detection methods was able to extract the outline of the different species."
      ]
    }
  ],
  "education": [
    {
      "institution": "Oregon State University",
      "area": "Statistics",
      "studyType": "Master of Science",
      "startDate": "2013-09-23",
      "gpa": "3.72",
      "courses": ["Time Series","Generalized Linear Models (GLM)","Simulations","Bayesian Statistics","Experimental Design"],
      "endDate": "2015-6-12"
    },
    {
      "institution": "California State University, Fullerton",
      "area": "Mathematics",
      "studyType": "Bachelors of Arts",
      "startDate": "2005-08-09",
      "gpa": "3.31",
      "courses": ["Mathematical Modeling","Functional Analysis","Numerical Methods","Differential Geometry","Inverse Problems"],
      "endDate": "2011-06-15"
    }
  ],
  "awards": [
  {
    "title": "LSAMP BD Fellow",
    "date": "2011-08-20",
    "awarder": "Louie Stokes Alliance for Minority Participation",
    "summary": "Fellowship that provided financial and assistance in students pursuing a PhD"
  },
  {
    "title": "Ronald E. McNair ",
    "date": "2009-06-14",
    "awarder": "TriO",
    "summary": "Program to prepare students to be succesful in graduate school."
  }],
  "publications": [{
    "name": "Statistical Modeling through Analytical and Monte Carlo Methods of the Fat Fraction in Magnetic Resonance Imaging (MRI)",
    "publisher": "Society for Industrial and Applied Mathematics Undergraduate Research Online (SIURO)",
    "releaseDate": "2012-06-21",
    "website": "http://dx.doi.org/10.1137/11S010931",
    "summary": "Our project studies the quantification of the uncertainty in fat-fraction estimates using Magnetic Resonance Imaging (MRI). The measured fat fraction is | F |    ⁄ ( | F | + | W |) ,where F is the fat signal and W is the water signal obtained using MRI. The fat and water signal magnitudes have a Rician distribution. However, the fat fraction has an unknown probability distribution. Knowing the fat-fraction probability distribution will provide us with a better understanding of the uncertainty of fat-fraction estimates used for the diagnosis of liver disease. Our current research focuses on finding the analytic distribution of the fat fraction and numerical simulation using Monte Carlo methods. In the analytic approach, we derived the probability density function of the fat fraction where the fat and water magnitudes follow a normal distribution (restricted to non-negative values) because the normal distribution approximates a Rician distribution for large signal-to- noise ratio (SNR). In the numerical approach, we applied Monte Carlo methods to optimize the fat-fraction estimation, compared analytic with numerical results, and found cases where current estimates of the fat fraction are inaccurate for low SNR. "
  }],
  "skills": [
    {
      "name": "Programming",
      "level": "Solid",
      "keywords": ["Python","R","Matlab","SAS","LaTeX"]
    }
  ],
  "languages": [
    {
      "language": "Korean",
      "fluency": "I get by"
    },
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ]
}
